Revit 2027 API
MacroManagerIterator.GetCurrent Method
 Returns the current Macro module.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroModule GetCurrent()
Public Function GetCurrent As MacroModule
public:
MacroModule^ GetCurrent()
member GetCurrent : unit -> MacroModule
Return Value
MacroModule
 The current Macro module.
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
See Also
Reference
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace